In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('data/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [31]:


titles['title'].value_counts().head(10)

Hamlet                  18
Carmen                  16
Macbeth                 15
The Outsider            12
Maya                    12
The Three Musketeers    11
Freedom                 11
Othello                 11
Temptation              11
Kismet                  11
Name: title, dtype: int64

### Which three years in the 1930s saw the most films released?

In [36]:
filter = (titles['year'] >=1930) &(titles['year'] <1940)

titles_30s = titles[filter]
titles_30s['year'].value_counts().head(3)

1937    1196
1936    1138
1938    1129
Name: year, dtype: int64

### Count the number of films that have been released in each decade over the history of cinema.

In [107]:
1992 - (1992 % 10)

1990

In [109]:
titles['decades'] = titles['year'] - (titles['year']%10)
titles['decades'].value_counts()

2010    67977
2000    38713
1990    22225
1980    20243
1970    18714
1960    17515
1950    12711
1930    10097
1920     8797
1940     8576
1910     6512
2020      210
1900       37
1890        3
Name: decades, dtype: int64

### Count the number of "Hamlet" films made in each decade.

In [120]:
filter_ = titles['title'].str.contains("Hamlet")
new_df = titles[filter_]
new_df['decades'].value_counts()

2010    16
2000    13
1990     6
1910     4
1970     4
1980     3
1960     3
1920     2
1950     1
1940     1
1930     1
Name: decades, dtype: int64

### Count the number of "Rustler" characters in each decade of the history of film.

In [118]:
cast['decades'] = cast['year'] - (cast['year']%10)
filter_ = cast['character'] == "Rustler"
new_df = cast[filter_]

new_df['decades'].value_counts()

1930    84
1940    18
1970     9
1950     8
1920     6
1990     4
2000     2
1960     2
1980     1
Name: decades, dtype: int64

### Count the number of "Hamlet" characters in each decade.

In [119]:
cast['decades'] = cast['year'] - (cast['year']%10)
filter_ = cast['character'] == "Hamlet"
new_df = cast[filter_]

new_df['decades'].value_counts()

2010    28
2000    19
1990    11
1970     8
1960     7
1910     6
1930     6
1950     3
1980     2
1940     1
1920     1
Name: decades, dtype: int64

### What are the 11 most common character names in movie history?

In [38]:
cast['character'].value_counts().head(11)

Himself        19600
Dancer         12096
Extra          10953
Reporter        8154
Doctor          7436
Student         7177
Policeman       6883
Party Guest     6742
Nurse           6676
Bartender       6613
Minor Role      6255
Name: character, dtype: int64

### Who are the 10 people most often credited as "Herself" in film history?

In [41]:
filter = cast['character'] == 'Herself'
cast_herself = cast[filter]
cast_herself['name'].value_counts().head(10)

Queen Elizabeth II    11
Joyce Brothers         9
Margaret Thatcher      8
Hillary Clinton        7
Mary Jo Pehl           7
Sumie Sakai            6
Joan Rivers            6
Bunny Yeager           5
Kareena Kapoor         5
Rekha                  5
Name: name, dtype: int64

### Who are the 10 people most often credited as "Himself" in film history?

In [42]:
filter = cast['character'] == 'Himself'
cast_herself = cast[filter]
cast_herself['name'].value_counts().head(10)

Adolf Hitler             100
Richard Nixon             46
Ronald Reagan             39
John F. Kennedy           34
Winston Churchill         24
Benito Mussolini          23
George W. Bush            23
Ron Jeremy                23
Martin Luther King        21
Franklin D. Roosevelt     20
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1945?

In [44]:
filter = cast['year'] == 1945
cast_1945 = cast[filter]
cast_1945['name'].value_counts()

Emmett Vogan          39
Sam (II) Harris       32
Bess Flowers          29
Harold Miller         29
Nolan Leary           27
                      ..
George (II) Backus     1
Curly Howard           1
James Hawley           1
Jack Welch             1
Danny (II) Hood        1
Name: name, Length: 7802, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1985?

In [45]:
filter = cast['year'] == 1985
cast_1985 = cast[filter]
cast_1985['name'].value_counts().head(8)

Mammootty        22
Shakti Kapoor    21
Sukumari         20
Aruna Irani      15
Lou Scheimer     15
Raj Babbar       15
Mohanlal         15
Deven Verma      13
Name: name, dtype: int64

### How many roles "Mammootty" has played in each year of his career.

In [50]:

cast_m = cast[cast['name'] == "Mammootty"]
cast_m['year'].value_counts()

1985    22
1983    18
1986    18
1984    16
1990    15
2009    12
1989    10
2008     9
1987     9
2010     9
2006     8
2004     8
2007     7
2011     7
1982     7
2012     7
1988     7
2000     7
1991     6
2005     6
2014     6
2015     6
2013     5
1995     5
1994     5
1993     5
1998     4
1999     4
2016     4
1992     3
1996     3
2001     3
2002     3
1981     3
1997     2
1980     2
2003     2
2017     1
1971     1
Name: year, dtype: int64

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [67]:
filter_ = cast.character.str.startswith("Patron in") 
cast[filter_]

,title,year,name,type,character,n
20628,Let It Ride,1989,Ralph Ahn,actor,Patron in Chinese Restaurant,43.0
23776,Alex Cross,2012,Anthony Akins,actor,Patron in restaurant,NaN
25314,Missing Pieces,2012,Rico Alago,actor,Patron in Restaurant,NaN
30163,The Black Bird,1975,John Alderman,actor,Patron in Ballroom,NaN
32347,Sparkle,2012,Eligah Alexander Jr.,actor,Patron in Audience,NaN
...,...,...,...,...,...,...
3293566,Above Suspicion,1943,Nita Pike,actress,Patron in Frisky Rabbit,NaN
3300726,Crashing,2007,Sachi Pollard,actress,Patron in the Coffee House,56.0
3513392,Crashing,2007,Talia Tinari,actress,Patron in the Coffee House,57.0
3515061,Breaking the Press,2010,Michelle Toche,actress,Patron in restaurant,NaN
3529675,Let It Ride,1989,Myra Turley,actress,Patron in Chinese Restaurant,37.0

### What are the 10 most frequent roles that start with the word "Science"?

In [69]:
filter_ = cast.character.str.startswith("Science") 
cast[filter_].head(10)

,title,year,name,type,character,n
11785,Teen Wolf Too,1987,Matthew T. Adams,actor,Science Student,NaN
32294,Three O'Clock High,1987,Michael Alex,actor,Science Kid,25.0
87420,Mutant Chronicles,2008,Roger Ashton-Griffiths,actor,Science Monk,13.0
135254,The Giggles,2013,Kevin Barnstein,actor,Science Performer 3,19.0
138469,Wilt,1990,Ian Barritt,actor,Science Teacher,22.0
148371,Thunderstruck,2012,Drew Battles,actor,Science Teacher,NaN
151244,The Gifted,2014,Jelson Bay,actor,Science Teacher,15.0
181171,Science Team,2014,Niki Berkon,actor,Science Promo Cadet,21.0
184968,Fantastic Four,2015,Eric Berris,actor,Science Fair Patron,NaN
219649,Robo-Dog: Airborne,2017,Paul Boffano,actor,Science Fair Judge #2,11.0

### Count number of n-values of the roles that Judi Dench has played over her career.

In [81]:
filter_ = cast['name'] == "Judi Dench"
name = cast[filter_]

name = judi.dropna()
name.groupby(by='n').count()

      title  year  name  type  character
n
1.0       6     6     6     6          6
2.0       6     6     6     6          6
3.0       6     6     6     6          6
4.0       4     4     4     4          4
5.0       2     2     2     2          2
6.0       4     4     4     4          4
7.0       4     4     4     4          4
8.0       1     1     1     1          1
9.0       1     1     1     1          1
12.0      3     3     3     3          3
13.0      2     2     2     2          2
16.0      2     2     2     2          2
18.0      2     2     2     2          2
20.0      1     1     1     1          1
23.0      1     1     1     1          1
26.0      1     1     1     1          1
29.0      1     1     1     1          1
40.0      1     1     1     1          1

### Count number of n-values of Cary Grant's roles through his career.

In [82]:
filter_ = cast['name'] == "Cary Grant"
name = cast[filter_]

name = judi.dropna()
name.groupby(by='n').count()

      title  year  name  type  character
n
1.0       6     6     6     6          6
2.0       6     6     6     6          6
3.0       6     6     6     6          6
4.0       4     4     4     4          4
5.0       2     2     2     2          2
6.0       4     4     4     4          4
7.0       4     4     4     4          4
8.0       1     1     1     1          1
9.0       1     1     1     1          1
12.0      3     3     3     3          3
13.0      2     2     2     2          2
16.0      2     2     2     2          2
18.0      2     2     2     2          2
20.0      1     1     1     1          1
23.0      1     1     1     1          1
26.0      1     1     1     1          1
29.0      1     1     1     1          1
40.0      1     1     1     1          1

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [104]:
filter_ = cast['name'] == "Sidney Poitier"
name = cast[filter_]

name = judi.dropna()
name['n'].value_counts()
# name.groupby(by='n').count()

3.0     6
1.0     6
2.0     6
7.0     4
4.0     4
6.0     4
12.0    3
5.0     2
18.0    2
16.0    2
13.0    2
23.0    1
26.0    1
20.0    1
40.0    1
8.0     1
29.0    1
9.0     1
Name: n, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [102]:
_filter = (cast['n'] == 1) & ((cast['year'] >= 1950) & (cast['year'] < 1960))# & (cast['type'] == 'actor')
roles = cast[_filter]
roles['type'].value_counts()
# name.groupby(by='type').count()

actor      6616
actress    2965
Name: type, dtype: int64

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [103]:
_filter = (cast['n'] == 1) & ((cast['year'] >= 1950) & (cast['year'] < 1960))# & (cast['type'] == 'actor')
roles = cast[_filter]
roles['type'].value_counts()

actor      6616
actress    2965
Name: type, dtype: int64